app/controllers/movies_controller.rb

  def same_director
    @movies = Movie.find_same_director(params[:id])
    title = Movie.find(params[:id]).title
---
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "4"]]